// Абстрактные классы

// Кроме обычных классов в некоторых языках существуют абстрактные классы. 
// От обычных классов они отличаются тем, что нельзя создать объект такого класса. 
// Зачем же нужен такой класс, спросит читатель? 
// Он нужен для того, чтобы от него могли наследоваться потомки — обычные классы, 
// объекты которых уже можно создавать.

// Абстрактный класс наряду с обычными методами содержит в себе абстрактные 
// методы без имплементации (с сигнатурой, но без кода), 
// которые обязан имплементировать программист, задумавший создать класс-потомок. 
// Абстрактные классы не обязательны, но они помогают установить контракт, 
// обязующий имплементировать определенный набор методов, 
// дабы уберечь программиста с плохой памятью от ошибки имплементации.

// Имплементация (программирование) — программная или аппаратная реализация 
// какого-либо протокола, алгоритма, технологии

